Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_ir.c
    /* Mask tx interrupt */
    IR_IntMask(IR_INT_TX, MASK);

    /* Clear tx interrupt */
    IR_ClrIntStatus(IR_INT_TX);

    /* Enable ir tx */
    IR_Enable(IR_TX);

    /* Wait for tx interrupt */
    while (SET != IR_GetIntStatus(IR_INT_TX)) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
            IR_Disable(IR_TX);

            return TIMEOUT;
        }
    }

    /* Disable ir tx */
    IR_Disable(IR_TX);

    /* Clear tx interrupt */
    IR_ClrIntStatus(IR_INT_TX);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR send in NEC protocol
 *
 * @param  address: Address
 * @param  command: Command
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_SendNEC(uint8_t address, uint8_t command)
{
    uint32_t tmpVal = ((~command & 0xff) << 24) + (command << 16) + ((~address & 0xff) << 8) + address;

    IR_SendCommand(0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR interrupt mask or unmask function
 *
 * @param  intType: IR interrupt type
 * @param  intMask: Mask or unmask
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_IntMask(IR_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_INT_TYPE(intType));

    if (intType == IR_INT_TX || intType == IR_INT_ALL) {
        /* Mask or unmask tx interrupt */
        tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
        BL_WR_REG(IR_BASE, IRTX_INT_STS, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRTX_END_MASK, intMask));
    }

    if (intType == IR_INT_RX || intType == IR_INT_ALL) {
        /* Mask or unmask rx interrupt */
        tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
        BL_WR_REG(IR_BASE, IRRX_INT_STS, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_END_MASK, intMask));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Clear ir interrupt function
 *
 * @param  intType: IR interrupt type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_ClrIntStatus(IR_INT_Type intType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_INT_TYPE(intType));

    if (intType == IR_INT_TX || intType == IR_INT_ALL) {
        /* Clear tx interrupt */
        tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
        BL_WR_REG(IR_BASE, IRTX_INT_STS, BL_SET_REG_BIT(tmpVal, IR_CR_IRTX_END_CLR));
    }

    if (intType == IR_INT_RX || intType == IR_INT_ALL) {
        /* Clear rx interrupt */
        tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
        BL_WR_REG(IR_BASE, IRRX_INT_STS, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_END_CLR));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR install interrupt callback function
 *
 * @param  intType: IR interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_Int_Callback_Install(IR_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_IR_INT_TYPE(intType));

    irIntCbfArra[intType] = cbFun;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR get interrupt status function
 *
 * @param  intType: IR int type
 *
 * @return IR tx or rx interrupt status
 *
*******************************************************************************/
BL_Sts_Type IR_GetIntStatus(IR_INT_Type intType)
{
    uint32_t tmpVal = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_INT_TYPE(intType));

    /* Read tx or rx interrupt status */
    if (IR_INT_TX == intType) {
        tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IRTX_END_INT);
    } else if (IR_INT_RX == intType) {
        tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IRRX_END_INT);
    }

    if (tmpVal) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  IR get rx fifo underflow or overflow status function
 *
 * @param  fifoSts: IR fifo status type
 *
 * @return IR rx fifo status
 *
*******************************************************************************/
BL_Sts_Type IR_GetRxFIFOStatus(IR_FifoStatus_Type fifoSts)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_FIFOSTATUS_TYPE(fifoSts));

    /* Read rx fifo status */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_SWM_FIFO_CONFIG_0);

    if (fifoSts == IR_RX_FIFO_UNDERFLOW) {
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IR_RX_FIFO_UNDERFLOW);
    } else {
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IR_RX_FIFO_OVERFLOW);
    }

    if (tmpVal) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  IR receive data function
 *
 * @param  irWord: IR rx data word 0 or 1
 *
 * @return Data received
 *
*******************************************************************************/
uint32_t IR_ReceiveData(IR_Word_Type irWord)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_WORD_TYPE(irWord));

    /* Read word 0 or word 1 */
    if (IR_WORD_0 == irWord) {
        tmpVal = BL_RD_REG(IR_BASE, IRRX_DATA_WORD0);
    } else {
        tmpVal = BL_RD_REG(IR_BASE, IRRX_DATA_WORD1);
    }

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  IR software mode receive pulse width data function
 *
 * @param  data: Data received
 * @param  length: Max length of receive buffer
 *
 * @return Length of datas received
 *
*******************************************************************************/
uint8_t IR_SWMReceiveData(uint16_t *data, uint8_t length)
{
    uint8_t rxLen = 0;

    while (rxLen < length && IR_GetRxFIFOCount() > 0) {
        /* Read data */
        data[rxLen++] = BL_RD_REG(IR_BASE, IRRX_SWM_FIFO_RDATA) & 0xffff;
    }

    return rxLen;
}

/****************************************************************************/ /**
 * @brief  IR receive in NEC protocol
 *
 * @param  address: Address
 * @param  command: Command
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type IR_ReceiveNEC(uint8_t *address, uint8_t *command)
{
    uint32_t tmpVal = IR_ReceiveData(IR_WORD_0);

