Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_ir.c
    /* Clear and mask rx interrupt */
    IR_ClrIntStatus(IR_INT_RX);
    IR_IntMask(IR_INT_RX, MASK);

    /* Enable ir rx */
    IR_Enable(IR_RX);

    /* Wait for rx interrupt */
    while (SET != IR_GetIntStatus(IR_INT_RX)) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
            IR_Disable(IR_RX);

            return TIMEOUT;
        }
    }

    /* Disable ir rx */
    IR_Disable(IR_RX);

    /* Clear rx interrupt */
    IR_ClrIntStatus(IR_INT_RX);

    /* Receive data according to mode */
    if (mode == IR_RX_NEC || mode == IR_RX_RC5) {
        /* Get data bit count */
        length = IR_GetRxDataBitCount();
        data[0] = IR_ReceiveData(IR_WORD_0);
    } else {
        /* Get fifo count */
        length = IR_GetRxFIFOCount();
        length = IR_SWMReceiveData((uint16_t *)data, length);
    }

    return length;
}

/****************************************************************************/ /**
 * @brief  IR send data according to mode which is learned function
 *
 * @param  mode: Protocol type
 * @param  data: Buffer of data to send
 * @param  length: Length of data
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_LearnToSend(IR_RxMode_Type mode, uint32_t *data, uint8_t length)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_RXMODE_TYPE(mode));

    /* Set send length */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRTX_DATA_NUM, length - 1);
    BL_WR_REG(IR_BASE, IRTX_CONFIG, tmpVal);

    if (mode == IR_RX_NEC || mode == IR_RX_RC5) {
        IR_SendCommand(0, data[0]);
    } else {
        IR_SWMSendCommand((uint16_t *)data, length);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR init to control led function
 *
 * @param  clk: Clock source
 * @param  div: Clock division(1~64)
 * @param  unit: Pulse width unit(multiples of clock pulse width, 1~4096)
 * @param  code0H: code 0 high level time(multiples of pulse width unit, 1~16)
 * @param  code0L: code 0 low level time(multiples of pulse width unit, 1~16)
 * @param  code1H: code 1 high level time(multiples of pulse width unit, 1~16)
 * @param  code1L: code 1 low level time(multiples of pulse width unit, 1~16)
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_LEDInit(HBN_XCLK_CLK_Type clk, uint8_t div, uint8_t unit, uint8_t code0H, uint8_t code0L, uint8_t code1H, uint8_t code1L)
{
    IR_TxCfg_Type txCfg = {
        24,      /* 24-bit data */
        DISABLE, /* Disable signal of tail pulse inverse */
        DISABLE, /* Disable signal of tail pulse */
        DISABLE, /* Disable signal of head pulse inverse */
        DISABLE, /* Disable signal of head pulse */
        DISABLE, /* Disable signal of logic 1 pulse inverse */
        DISABLE, /* Disable signal of logic 0 pulse inverse */
        ENABLE,  /* Enable signal of data pulse */
        DISABLE, /* Disable signal of output modulation */
        ENABLE   /* Enable signal of output inverse */
    };

    IR_TxPulseWidthCfg_Type txPWCfg = {
        code0L, /* Pulse width of logic 0 pulse phase 1 */
        code0H, /* Pulse width of logic 0 pulse phase 0 */
        code1L, /* Pulse width of logic 1 pulse phase 1 */
        code1H, /* Pulse width of logic 1 pulse phase 0 */
        1,      /* Pulse width of head pulse phase 1 */
        1,      /* Pulse width of head pulse phase 0 */
        1,      /* Pulse width of tail pulse phase 1 */
        1,      /* Pulse width of tail pulse phase 0 */
        1,      /* Modulation phase 1 width */
        1,      /* Modulation phase 0 width */
        unit    /* Pulse width unit */
    };

    HBN_Set_XCLK_CLK_Sel(clk);
    GLB_Set_IR_CLK(ENABLE, GLB_IR_CLK_SRC_XCLK, div - 1);

    /* Disable ir before config */
    IR_Disable(IR_TXRX);

    /* IR tx init */
    IR_TxInit(&txCfg);
    IR_TxPulseWidthConfig(&txPWCfg);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR send 24-bit data to control led function
 *
 * @param  data: Data to send(24-bit)
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_LEDSend(uint32_t data)
{
    /* Change MSB_first to LSB_first */
    data = ((data >> 1) & 0x55555555) | ((data << 1) & 0xaaaaaaaa);
    data = ((data >> 2) & 0x33333333) | ((data << 2) & 0xcccccccc);
    data = ((data >> 4) & 0x0f0f0f0f) | ((data << 4) & 0xf0f0f0f0);
    data = ((data >> 16) & 0xff) | (data & 0xff00) | ((data << 16) & 0xff0000);
    IR_SendCommand(0, data);

    return SUCCESS;
}

/*@} end of group IR_Public_Functions */

/*@} end of group IR */

/*@} end of group BL602_Peripheral_Driver */
